Revit 2026 API

# ThermalAssetPermeability Property

---

The permeability of the asset.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Permeability { get; set; }
```
```vb
Public Property Permeability As Double
	Get
	Set
```
```cpp
public:
property double Permeability {
	double get ();
	void set (double value);
}
```
```fsharp
member Permeability : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for permeability must be non-negative. |

Values are in seconds per foot (s/ft) and must be non-negative.

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace